alpha_0.65/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
12992
(
( 0.0002529195626 -0.0003810117487 -0.0003987019008 )
( 0.0003271107562 -0.0002885822323 -0.0004059328639 )
( -0.0002081599232 -0.0003123880597 -0.0004165810242 )
( 0.0003925918136 -0.0001686780161 -0.0004109285073 )
( -0.0001299364085 -0.0002375895856 -0.0004098574864 )
( -0.0004478811752 -0.0002703258069 -0.0004211298074 )
( -0.0004901519278 -0.0002838846121 -0.0004216827801 )
( -6.829568883e-05 -0.0001269268105 -0.0003995074658 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
